timbitss/esp32-smartwatch-sw/components/BMA423/bma4_defs.h
/**\name Macro to define accelerometer configuration value for FOC */
#define BMA4_FOC_ACC_CONF_VAL                     UINT8_C(0xB7)

/**\name SPI,I2C SELECTION REGISTER*/
#define BMA4_NV_CONFIG_ADDR                       UINT8_C(0x70)

/**\name ACCEL OFFSET REGISTERS*/
#define BMA4_OFFSET_0_ADDR                        UINT8_C(0X71)
#define BMA4_OFFSET_1_ADDR                        UINT8_C(0X72)
#define BMA4_OFFSET_2_ADDR                        UINT8_C(0X73)

/**\name POWER_CTRL REGISTER*/
#define BMA4_POWER_CONF_ADDR                      UINT8_C(0x7C)
#define BMA4_POWER_CTRL_ADDR                      UINT8_C(0x7D)

/**\name COMMAND REGISTER*/
#define BMA4_CMD_ADDR                             UINT8_C(0X7E)

/**\name GPIO REGISTERS*/
#define BMA4_STEP_CNT_OUT_0_ADDR                  UINT8_C(0x1E)
#define BMA4_HIGH_G_OUT_ADDR                      UINT8_C(0x1F)
#define BMA4_ACTIVITY_OUT_ADDR                    UINT8_C(0x27)
#define BMA4_ORIENTATION_OUT_ADDR                 UINT8_C(0x28)
#define BMA4_INTERNAL_STAT                        UINT8_C(0x2A)

/*!
 * @brief Block size for config write
 */
#define BMA4_BLOCK_SIZE                           UINT8_C(32)

/**\name I2C slave address */
#define BMA4_I2C_ADDR_PRIMARY                     UINT8_C(0x18)
#define BMA4_I2C_ADDR_SECONDARY                   UINT8_C(0x19)
#define BMA4_I2C_BMM150_ADDR                      UINT8_C(0x10)

/**\name Interface selection macro */
#define BMA4_SPI_WR_MASK                          UINT8_C(0x7F)
#define BMA4_SPI_RD_MASK                          UINT8_C(0x80)

/**\name Chip ID macros */
#define BMA4_CHIP_ID_MIN                          UINT8_C(0x10)
#define BMA4_CHIP_ID_MAX                          UINT8_C(0x15)

/**\name Auxiliary sensor selection macro */
#define BMM150_SENSOR                             UINT8_C(1)
#define AKM9916_SENSOR                            UINT8_C(2)
#define BMA4_ASIC_INITIALIZED                     UINT8_C(0x01)

/**\name Auxiliary sensor chip id macros */
#define BMM150_CHIP_ID                            UINT8_C(0x32)

/**\name Auxiliary sensor other macros */
#define BMM150_POWER_CONTROL_REG                  UINT8_C(0x4B)
#define BMM150_POWER_MODE_REG                     UINT8_C(0x4C)

/**\name    CONSTANTS */
#define BMA4_FIFO_CONFIG_LENGTH                   UINT8_C(2)
#define BMA4_ACCEL_CONFIG_LENGTH                  UINT8_C(2)
#define BMA4_FIFO_WM_LENGTH                       UINT8_C(2)
#define BMA4_NON_LATCH_MODE                       UINT8_C(0)
#define BMA4_LATCH_MODE                           UINT8_C(1)
#define BMA4_OPEN_DRAIN                           UINT8_C(1)
#define BMA4_PUSH_PULL                            UINT8_C(0)
#define BMA4_ACTIVE_HIGH                          UINT8_C(1)
#define BMA4_ACTIVE_LOW                           UINT8_C(0)
#define BMA4_EDGE_TRIGGER                         UINT8_C(1)
#define BMA4_LEVEL_TRIGGER                        UINT8_C(0)
#define BMA4_OUTPUT_ENABLE                        UINT8_C(1)
#define BMA4_OUTPUT_DISABLE                       UINT8_C(0)
#define BMA4_INPUT_ENABLE                         UINT8_C(1)
#define BMA4_INPUT_DISABLE                        UINT8_C(0)

/**\name ACCEL RANGE CHECK*/
#define BMA4_ACCEL_RANGE_2G                       UINT8_C(0)
#define BMA4_ACCEL_RANGE_4G                       UINT8_C(1)
#define BMA4_ACCEL_RANGE_8G                       UINT8_C(2)
#define BMA4_ACCEL_RANGE_16G                      UINT8_C(3)

/**\name  CONDITION CHECK FOR READING AND WRTING DATA*/
#define BMA4_MAX_VALUE_FIFO_FILTER                UINT8_C(1)
#define BMA4_MAX_VALUE_SPI3                       UINT8_C(1)
#define BMA4_MAX_VALUE_SELFTEST_AMP               UINT8_C(1)
#define BMA4_MAX_IF_MODE                          UINT8_C(3)
#define BMA4_MAX_VALUE_SELFTEST_SIGN              UINT8_C(1)

/**\name BUS READ AND WRITE LENGTH FOR MAG & ACCEL*/
#define BMA4_MAG_TRIM_DATA_SIZE                   UINT8_C(16)
#define BMA4_MAG_XYZ_DATA_LENGTH                  UINT8_C(6)
#define BMA4_MAG_XYZR_DATA_LENGTH                 UINT8_C(8)
#define BMA4_ACCEL_DATA_LENGTH                    UINT8_C(6)
#define BMA4_FIFO_DATA_LENGTH                     UINT8_C(2)
#define BMA4_TEMP_DATA_SIZE                       UINT8_C(1)

/**\name TEMPERATURE CONSTANT */
#define BMA4_OFFSET_TEMP                          UINT8_C(23)
#define BMA4_DEG                                  UINT8_C(1)
#define BMA4_FAHREN                               UINT8_C(2)
#define BMA4_KELVIN                               UINT8_C(3)

/**\name DELAY DEFINITION IN MSEC*/
#define BMA4_AUX_IF_DELAY                         UINT8_C(5)
#define BMA4_BMM150_WAKEUP_DELAY1                 UINT8_C(2)
#define BMA4_BMM150_WAKEUP_DELAY2                 UINT8_C(3)
#define BMA4_BMM150_WAKEUP_DELAY3                 UINT8_C(1)
#define BMA4_GEN_READ_WRITE_DELAY                 UINT16_C(1000)
#define BMA4_AUX_COM_DELAY                        UINT16_C(10000)

/**\name    ARRAY PARAMETER DEFINITIONS*/
#define BMA4_SENSOR_TIME_MSB_BYTE                 UINT8_C(2)
#define BMA4_SENSOR_TIME_XLSB_BYTE                UINT8_C(1)
#define BMA4_SENSOR_TIME_LSB_BYTE                 UINT8_C(0)
#define BMA4_MAG_X_LSB_BYTE                       UINT8_C(0)
#define BMA4_MAG_X_MSB_BYTE                       UINT8_C(1)
#define BMA4_MAG_Y_LSB_BYTE                       UINT8_C(2)
#define BMA4_MAG_Y_MSB_BYTE                       UINT8_C(3)
#define BMA4_MAG_Z_LSB_BYTE                       UINT8_C(4)
#define BMA4_MAG_Z_MSB_BYTE                       UINT8_C(5)
#define BMA4_MAG_R_LSB_BYTE                       UINT8_C(6)
#define BMA4_MAG_R_MSB_BYTE                       UINT8_C(7)
#define BMA4_TEMP_BYTE                            UINT8_C(0)
#define BMA4_FIFO_LENGTH_MSB_BYTE                 UINT8_C(1)

/*! @name To define success code */
#define BMA4_OK                                   INT8_C(0)

/*! @name To define error codes */
#define BMA4_E_NULL_PTR                           INT8_C(-1)
#define BMA4_E_COM_FAIL                           INT8_C(-2)
#define BMA4_E_DEV_NOT_FOUND                      INT8_C(-3)
#define BMA4_E_INVALID_SENSOR                     INT8_C(-4)
#define BMA4_E_CONFIG_STREAM_ERROR                INT8_C(-5)
#define BMA4_E_SELF_TEST_FAIL                     INT8_C(-6)
#define BMA4_E_FOC_FAIL                           INT8_C(-7)
#define BMA4_E_OUT_OF_RANGE                       INT8_C(-8)
#define BMA4_E_INT_LINE_INVALID                   INT8_C(-9)
#define BMA4_E_RD_WR_LENGTH_INVALID               INT8_C(-10)
#define BMA4_E_AUX_CONFIG_FAIL                    INT8_C(-11)
#define BMA4_E_SC_FIFO_HEADER_ERR                 INT8_C(-12)
#define BMA4_E_SC_FIFO_CONFIG_ERR                 INT8_C(-13)

/**\name    UTILITY MACROS  */
#define BMA4_SET_LOW_BYTE                         UINT16_C(0x00FF)
#define BMA4_SET_HIGH_BYTE                        UINT16_C(0xFF00)
#define BMA4_SET_LOW_NIBBLE                       UINT8_C(0x0F)

