timbitss/esp32-smartwatch-sw/components/BMA423/bma4_defs.h
/* Macros used for Self test (BMA42X_VARIANT) */
/* Self-test: Resulting minimum difference signal in mg for BMA42X */
#define BMA42X_ST_ACC_X_AXIS_SIGNAL_DIFF          UINT16_C(400)
#define BMA42X_ST_ACC_Y_AXIS_SIGNAL_DIFF          UINT16_C(800)
#define BMA42X_ST_ACC_Z_AXIS_SIGNAL_DIFF          UINT16_C(400)

/* Macros used for Self test (BMA42X_B_VARIANT) */
/* Self-test: Resulting minimum difference signal in mg for BMA42X_B */
#define BMA42X_B_ST_ACC_X_AXIS_SIGNAL_DIFF        UINT16_C(1800)
#define BMA42X_B_ST_ACC_Y_AXIS_SIGNAL_DIFF        UINT16_C(1800)
#define BMA42X_B_ST_ACC_Z_AXIS_SIGNAL_DIFF        UINT16_C(1800)

/* Macros used for Self test (BMA45X_VARIANT) */
/* Self-test: Resulting minimum difference signal in mg for BMA45X */
#define BMA45X_ST_ACC_X_AXIS_SIGNAL_DIFF          UINT16_C(1800)
#define BMA45X_ST_ACC_Y_AXIS_SIGNAL_DIFF          UINT16_C(1800)
#define BMA45X_ST_ACC_Z_AXIS_SIGNAL_DIFF          UINT16_C(1800)

/**\name BOOLEAN TYPES*/
#ifndef TRUE
#define TRUE                                      UINT8_C(0x01)
#endif

#ifndef FALSE
#define FALSE                                     UINT8_C(0x00)
#endif

#ifndef NULL
#define NULL                                      UINT8_C(0x00)
#endif

/**\name    ERROR STATUS POSITION AND MASK*/
#define BMA4_FATAL_ERR_MSK                        UINT8_C(0x01)
#define BMA4_CMD_ERR_POS                          UINT8_C(1)
#define BMA4_CMD_ERR_MSK                          UINT8_C(0x02)
#define BMA4_ERR_CODE_POS                         UINT8_C(2)
#define BMA4_ERR_CODE_MSK                         UINT8_C(0x1C)
#define BMA4_FIFO_ERR_POS                         UINT8_C(6)
#define BMA4_FIFO_ERR_MSK                         UINT8_C(0x40)
#define BMA4_AUX_ERR_POS                          UINT8_C(7)
#define BMA4_AUX_ERR_MSK                          UINT8_C(0x80)

/**\name    NV_CONFIG POSITION AND MASK*/
/* NV_CONF Description - Reg Addr --> (0x70), Bit --> 3 */
#define BMA4_NV_ACCEL_OFFSET_POS                  UINT8_C(3)
#define BMA4_NV_ACCEL_OFFSET_MSK                  UINT8_C(0x08)

/**\name    MAG DATA XYZ POSITION AND MASK*/
#define BMA4_DATA_MAG_X_LSB_POS                   UINT8_C(3)
#define BMA4_DATA_MAG_X_LSB_MSK                   UINT8_C(0xF8)
#define BMA4_DATA_MAG_Y_LSB_POS                   UINT8_C(3)
#define BMA4_DATA_MAG_Y_LSB_MSK                   UINT8_C(0xF8)
#define BMA4_DATA_MAG_Z_LSB_POS                   UINT8_C(1)
#define BMA4_DATA_MAG_Z_LSB_MSK                   UINT8_C(0xFE)
#define BMA4_DATA_MAG_R_LSB_POS                   UINT8_C(2)
#define BMA4_DATA_MAG_R_LSB_MSK                   UINT8_C(0xFC)

/**\name ACCEL DATA READY POSITION AND MASK*/
#define BMA4_STAT_DATA_RDY_ACCEL_POS              UINT8_C(7)
#define BMA4_STAT_DATA_RDY_ACCEL_MSK              UINT8_C(0x80)

/**\name MAG DATA READY POSITION AND MASK*/
#define BMA4_STAT_DATA_RDY_MAG_POS                UINT8_C(5)
#define BMA4_STAT_DATA_RDY_MAG_MSK                UINT8_C(0x20)

/**\name ADVANCE POWER SAVE POSITION AND MASK*/
#define BMA4_ADVANCE_POWER_SAVE_MSK               UINT8_C(0x01)

/**\name ACCELEROMETER ENABLE POSITION AND MASK*/
#define BMA4_ACCEL_ENABLE_POS                     UINT8_C(2)
#define BMA4_ACCEL_ENABLE_MSK                     UINT8_C(0x04)

/**\name MAGNETOMETER ENABLE POSITION AND MASK*/
#define BMA4_MAG_ENABLE_MSK                       UINT8_C(0x01)

/**\name    ACCEL CONFIGURATION POSITION AND MASK*/
#define BMA4_ACCEL_ODR_MSK                        UINT8_C(0x0F)
#define BMA4_ACCEL_BW_POS                         UINT8_C(4)
#define BMA4_ACCEL_BW_MSK                         UINT8_C(0x70)
#define BMA4_ACCEL_RANGE_MSK                      UINT8_C(0x03)
#define BMA4_ACCEL_PERFMODE_POS                   UINT8_C(7)
#define BMA4_ACCEL_PERFMODE_MSK                   UINT8_C(0x80)

/**\name    MAG CONFIGURATION POSITION AND MASK*/
#define BMA4_MAG_CONFIG_OFFSET_POS                UINT8_C(4)
#define BMA4_MAG_CONFIG_OFFSET_LEN                UINT8_C(4)
#define BMA4_MAG_CONFIG_OFFSET_MSK                UINT8_C(0xF0)
#define BMA4_MAG_CONFIG_OFFSET_REG                (BMA4_AUX_CONFIG_ADDR)

/**\name FIFO SELF WAKE UP POSITION AND MASK*/
#define BMA4_FIFO_SELF_WAKE_UP_POS                UINT8_C(1)
#define BMA4_FIFO_SELF_WAKE_UP_MSK                UINT8_C(0x02)

/**\name    FIFO BYTE COUNTER POSITION AND MASK*/
#define BMA4_FIFO_BYTE_COUNTER_MSB_MSK            UINT8_C(0x3F)

/**\name    FIFO DATA POSITION AND MASK*/
#define BMA4_FIFO_DATA_POS                        UINT8_C(0)
#define BMA4_FIFO_DATA_MSK                        UINT8_C(0xFF)

/**\name    FIFO FILTER FOR ACCEL  POSITION AND MASK*/
#define BMA4_FIFO_DOWN_ACCEL_POS                  UINT8_C(4)
#define BMA4_FIFO_DOWN_ACCEL_MSK                  UINT8_C(0x70)
#define BMA4_FIFO_FILTER_ACCEL_POS                UINT8_C(7)
#define BMA4_FIFO_FILTER_ACCEL_MSK                UINT8_C(0x80)

/**\name    FIFO HEADER DATA DEFINITIONS    */
#define BMA4_FIFO_HEAD_A                          UINT8_C(0x84)
#define BMA4_FIFO_HEAD_M                          UINT8_C(0x90)
#define BMA4_FIFO_HEAD_M_A                        UINT8_C(0x94)
#define BMA4_FIFO_HEAD_SENSOR_TIME                UINT8_C(0x44)
#define BMA4_FIFO_HEAD_INPUT_CONFIG               UINT8_C(0x48)
#define BMA4_FIFO_HEAD_SKIP_FRAME                 UINT8_C(0x40)
#define BMA4_FIFO_HEAD_OVER_READ_MSB              UINT8_C(0x80)
#define BMA4_FIFO_HEAD_SAMPLE_DROP                UINT8_C(0x50)

/**\name    FIFO HEADERLESS MODE DATA ENABLE DEFINITIONS   */
#define BMA4_FIFO_M_A_ENABLE                      UINT8_C(0x60)
#define BMA4_FIFO_A_ENABLE                        UINT8_C(0x40)
#define BMA4_FIFO_M_ENABLE                        UINT8_C(0x20)

/**\name    FIFO CONFIGURATION SELECTION    */
#define BMA4_FIFO_STOP_ON_FULL                    UINT8_C(0x01)
#define BMA4_FIFO_TIME                            UINT8_C(0x02)
#define BMA4_FIFO_TAG_INTR2                       UINT8_C(0x04)
#define BMA4_FIFO_TAG_INTR1                       UINT8_C(0x08)
#define BMA4_FIFO_HEADER                          UINT8_C(0x10)
#define BMA4_FIFO_MAG                             UINT8_C(0x20)
#define BMA4_FIFO_ACCEL                           UINT8_C(0x40)
#define BMA4_FIFO_ALL                             UINT8_C(0x7F)
#define BMA4_FIFO_CONFIG_0_MASK                   UINT8_C(0x03)
#define BMA4_FIFO_CONFIG_1_MASK                   UINT8_C(0xFC)

/**\name    FIFO FRAME COUNT DEFINITION     */
#define BMA4_FIFO_LSB_CONFIG_CHECK                UINT8_C(0x00)
#define BMA4_FIFO_MSB_CONFIG_CHECK                UINT8_C(0x80)
#define BMA4_FIFO_TAG_INTR_MASK                   UINT8_C(0xFC)

