timbitss/esp32-smartwatch-sw/components/BMA423/bma4_defs.h
/**\name    FIFO DROPPED FRAME DEFINITION     */
#define BMA4_AUX_FIFO_DROP                        UINT8_C(0x04)
#define BMA4_ACCEL_AUX_FIFO_DROP                  UINT8_C(0x05)
#define BMA4_ACCEL_FIFO_DROP                      UINT8_C(0x01)

/**\name FIFO MAG DEFINITION*/
#define BMA4_MA_FIFO_A_X_LSB                      UINT8_C(8)

/**\name FIFO sensor time length definitions*/
#define BMA4_SENSOR_TIME_LENGTH                   UINT8_C(3)

/**\name FIFO LENGTH DEFINITION*/
#define BMA4_FIFO_A_LENGTH                        UINT8_C(6)
#define BMA4_FIFO_M_LENGTH                        UINT8_C(8)
#define BMA4_FIFO_MA_LENGTH                       UINT8_C(14)

/**\name    MAG I2C ADDRESS SELECTION POSITION AND MASK*/
#define BMA4_I2C_DEVICE_ADDR_POS                  UINT8_C(1)
#define BMA4_I2C_DEVICE_ADDR_MSK                  UINT8_C(0xFE)

/**\name MAG CONFIGURATION FOR SECONDARY INTERFACE POSITION AND MASK*/
#define BMA4_MAG_BURST_MSK                        UINT8_C(0x03)
#define BMA4_MAG_MANUAL_ENABLE_POS                UINT8_C(7)
#define BMA4_MAG_MANUAL_ENABLE_MSK                UINT8_C(0x80)
#define BMA4_READ_ADDR_MSK                        UINT8_C(0xFF)
#define BMA4_WRITE_ADDR_MSK                       UINT8_C(0xFF)
#define BMA4_WRITE_DATA_MSK                       UINT8_C(0xFF)

/**\name    OUTPUT TYPE ENABLE POSITION AND MASK*/
#define BMA4_INT_EDGE_CTRL_MASK                   UINT8_C(0x01)
#define BMA4_INT_EDGE_CTRL_POS                    UINT8_C(0x00)
#define BMA4_INT_LEVEL_MASK                       UINT8_C(0x02)
#define BMA4_INT_LEVEL_POS                        UINT8_C(0x01)
#define BMA4_INT_OPEN_DRAIN_MASK                  UINT8_C(0x04)
#define BMA4_INT_OPEN_DRAIN_POS                   UINT8_C(0x02)
#define BMA4_INT_OUTPUT_EN_MASK                   UINT8_C(0x08)
#define BMA4_INT_OUTPUT_EN_POS                    UINT8_C(0x03)
#define BMA4_INT_INPUT_EN_MASK                    UINT8_C(0x10)
#define BMA4_INT_INPUT_EN_POS                     UINT8_C(0x04)

/**\name    IF CONFIG POSITION AND MASK*/
#define BMA4_CONFIG_SPI3_MSK                      UINT8_C(0x01)
#define BMA4_IF_CONFIG_IF_MODE_POS                UINT8_C(4)
#define BMA4_IF_CONFIG_IF_MODE_MSK                UINT8_C(0x10)

/**\name    ACCEL SELF TEST POSITION AND MASK*/
#define BMA4_ACCEL_SELFTEST_ENABLE_MSK            UINT8_C(0x01)
#define BMA4_ACCEL_SELFTEST_SIGN_POS              UINT8_C(2)
#define BMA4_ACCEL_SELFTEST_SIGN_MSK              UINT8_C(0x04)
#define BMA4_SELFTEST_AMP_POS                     UINT8_C(3)
#define BMA4_SELFTEST_AMP_MSK                     UINT8_C(0x08)

/**\name    ACCEL ODR          */
#define BMA4_OUTPUT_DATA_RATE_0_78HZ              UINT8_C(0x01)
#define BMA4_OUTPUT_DATA_RATE_1_56HZ              UINT8_C(0x02)
#define BMA4_OUTPUT_DATA_RATE_3_12HZ              UINT8_C(0x03)
#define BMA4_OUTPUT_DATA_RATE_6_25HZ              UINT8_C(0x04)
#define BMA4_OUTPUT_DATA_RATE_12_5HZ              UINT8_C(0x05)
#define BMA4_OUTPUT_DATA_RATE_25HZ                UINT8_C(0x06)
#define BMA4_OUTPUT_DATA_RATE_50HZ                UINT8_C(0x07)
#define BMA4_OUTPUT_DATA_RATE_100HZ               UINT8_C(0x08)
#define BMA4_OUTPUT_DATA_RATE_200HZ               UINT8_C(0x09)
#define BMA4_OUTPUT_DATA_RATE_400HZ               UINT8_C(0x0A)
#define BMA4_OUTPUT_DATA_RATE_800HZ               UINT8_C(0x0B)
#define BMA4_OUTPUT_DATA_RATE_1600HZ              UINT8_C(0x0C)

/**\name    ACCEL BANDWIDTH PARAMETER         */
#define BMA4_ACCEL_OSR4_AVG1                      UINT8_C(0)
#define BMA4_ACCEL_OSR2_AVG2                      UINT8_C(1)
#define BMA4_ACCEL_NORMAL_AVG4                    UINT8_C(2)
#define BMA4_ACCEL_CIC_AVG8                       UINT8_C(3)
#define BMA4_ACCEL_RES_AVG16                      UINT8_C(4)
#define BMA4_ACCEL_RES_AVG32                      UINT8_C(5)
#define BMA4_ACCEL_RES_AVG64                      UINT8_C(6)
#define BMA4_ACCEL_RES_AVG128                     UINT8_C(7)

/**\name    ACCEL PERFMODE PARAMETER         */
#define BMA4_CIC_AVG_MODE                         UINT8_C(0)
#define BMA4_CONTINUOUS_MODE                      UINT8_C(1)

/**\name    MAG OFFSET         */
#define BMA4_MAG_OFFSET_MAX                       UINT8_C(0x00)

/**\name    ENABLE/DISABLE SELECTIONS        */
#define BMA4_X_AXIS                               UINT8_C(0)
#define BMA4_Y_AXIS                               UINT8_C(1)
#define BMA4_Z_AXIS                               UINT8_C(2)

/**\name SELF TEST*/
#define BMA4_SELFTEST_PASS                        INT8_C(0)
#define BMA4_SELFTEST_FAIL                        INT8_C(1)

#define BMA4_SELFTEST_DIFF_X_AXIS_FAILED          INT8_C(1)
#define BMA4_SELFTEST_DIFF_Y_AXIS_FAILED          INT8_C(2)
#define BMA4_SELFTEST_DIFF_Z_AXIS_FAILED          INT8_C(3)
#define BMA4_SELFTEST_DIFF_X_AND_Y_AXIS_FAILED    INT8_C(4)
#define BMA4_SELFTEST_DIFF_X_AND_Z_AXIS_FAILED    INT8_C(5)
#define BMA4_SELFTEST_DIFF_Y_AND_Z_AXIS_FAILED    INT8_C(6)
#define BMA4_SELFTEST_DIFF_X_Y_AND_Z_AXIS_FAILED  INT8_C(7)

/**\name INTERRUPT MAPS    */
#define BMA4_INTR1_MAP                            UINT8_C(0)
#define BMA4_INTR2_MAP                            UINT8_C(1)

/**\name    INTERRUPT MASKS        */
#define BMA4_FIFO_FULL_INT                        UINT16_C(0x0100)
#define BMA4_FIFO_WM_INT                          UINT16_C(0x0200)
#define BMA4_DATA_RDY_INT                         UINT16_C(0x0400)
#define BMA4_MAG_DATA_RDY_INT                     UINT16_C(0x2000)
#define BMA4_ACCEL_DATA_RDY_INT                   UINT16_C(0x8000)

/**\name    AKM POWER MODE SELECTION     */
#define BMA4_AKM_POWER_DOWN_MODE                  UINT8_C(0)
#define BMA4_AKM_SINGLE_MEAS_MODE                 UINT8_C(1)

/**\name    SECONDARY_MAG POWER MODE SELECTION    */
#define BMA4_MAG_FORCE_MODE                       UINT8_C(0)
#define BMA4_MAG_SUSPEND_MODE                     UINT8_C(1)

/**\name    MAG POWER MODE SELECTION    */
#define BMA4_FORCE_MODE                           UINT8_C(0)
#define BMA4_SUSPEND_MODE                         UINT8_C(1)

/**\name    ACCEL POWER MODE    */
#define BMA4_ACCEL_MODE_NORMAL                    UINT8_C(0x11)

/**\name    MAG POWER MODE    */
#define BMA4_MAG_MODE_SUSPEND                     UINT8_C(0x18)

/**\name    ENABLE/DISABLE BIT VALUES    */
#define BMA4_ENABLE                               UINT8_C(0x01)
#define BMA4_DISABLE                              UINT8_C(0x00)

/**\name    DEFINITION USED FOR DIFFERENT WRITE   */
#define BMA4_MANUAL_DISABLE                       UINT8_C(0x00)
#define BMA4_MANUAL_ENABLE                        UINT8_C(0x01)
#define BMA4_ENABLE_MAG_IF_MODE                   UINT8_C(0x01)
#define BMA4_MAG_DATA_READ_REG                    UINT8_C(0x0A)
#define BMA4_BMM_POWER_MODE_REG                   UINT8_C(0x06)
#define BMA4_SEC_IF_NULL                          UINT8_C(0)
#define BMA4_SEC_IF_BMM150                        UINT8_C(1)
#define BMA4_SEC_IF_AKM09916                      UINT8_C(2)
#define BMA4_ENABLE_AUX_IF_MODE                   UINT8_C(0x01)

