timbitss/esp32-smartwatch-sw/components/BMA423/bma4_defs.h
/**\name    SENSOR RESOLUTION   */
#define BMA4_12_BIT_RESOLUTION                    UINT8_C(12)
#define BMA4_14_BIT_RESOLUTION                    UINT8_C(14)
#define BMA4_16_BIT_RESOLUTION                    UINT8_C(16)

/**\name FOC MACROS */
#define BMA4_FOC_SAMPLE_LIMIT                     UINT8_C(128)
#define BMA4_MAX_NOISE_LIMIT(RANGE_VALUE)         (RANGE_VALUE + UINT16_C(255))
#define BMA4_MIN_NOISE_LIMIT(RANGE_VALUE)         (RANGE_VALUE - UINT16_C(255))

/*! for handling float temperature values */
#define BMA4_SCALE_TEMP                           INT32_C(1000)

/* BMA4_FAHREN_SCALED = 1.8 * 1000 */
#define BMA4_FAHREN_SCALED                        INT32_C(1800)

/* BMA4_KELVIN_SCALED = 273.15 * 1000 */
#define BMA4_KELVIN_SCALED                        INT32_C(273150)

/**\name    MAP BURST READ LENGTHS  */
#define BMA4_AUX_READ_LEN_0                       UINT8_C(0)
#define BMA4_AUX_READ_LEN_1                       UINT8_C(1)
#define BMA4_AUX_READ_LEN_2                       UINT8_C(2)
#define BMA4_AUX_READ_LEN_3                       UINT8_C(3)

#define BMA4_CONFIG_STREAM_MESSAGE_MSK            UINT8_C(0x0F)

#define BMA4_SOFT_RESET                           UINT8_C(0XB6)

#define BMA4_MS_TO_US(X)                          (X * 1000)

#ifndef ABS
#define ABS(a)                                    ((a) > 0 ? (a) : -(a)) /*!< Absolute value */
#endif

/**\name    BIT SLICE GET AND SET FUNCTIONS */
#define BMA4_GET_BITSLICE(regvar, bitname) \
    ((regvar & bitname##_MSK) >> bitname##_POS)

#define BMA4_SET_BITSLICE(regvar, bitname, val) \
    ((regvar & ~bitname##_MSK) | \
     ((val << bitname##_POS) & bitname##_MSK))

#define BMA4_GET_DIFF(x, y)                       ((x) - (y))

#define BMA4_GET_LSB(var)                         (uint8_t)(var & BMA4_SET_LOW_BYTE)
#define BMA4_GET_MSB(var)                         (uint8_t)((var & BMA4_SET_HIGH_BYTE) >> 8)

#define BMA4_SET_BIT_VAL_0(reg_data, bitname)     (reg_data & ~(bitname##_MSK))

#define BMA4_SET_BITS_POS_0(reg_data, bitname, data) \
    ((reg_data & ~(bitname##_MSK)) | \
     (data & bitname##_MSK))

#define BMA4_GET_BITS_POS_0(reg_data, bitname)    (reg_data & (bitname##_MSK))

/**
 * BMA4_INTF_RET_TYPE is the read/write interface return type which can be overwritten by the build system.
 * The default is set to int8_t.
 */
#ifndef BMA4_INTF_RET_TYPE
#define BMA4_INTF_RET_TYPE                        int8_t
#endif

/**
 * BST_INTF_RET_SUCCESS is the success return value read/write interface return type which can be
 * overwritten by the build system. The default is set to 0. It is used to check for a successful
 * execution of the read/write functions
 */
#ifndef BMA4_INTF_RET_SUCCESS
#define BMA4_INTF_RET_SUCCESS                     INT8_C(0)
#endif

/******************************************************************************/
/*!  @name         TYPEDEF DEFINITIONS                                        */
/******************************************************************************/

/*!
 * @brief Bus communication function pointer which should be mapped to
 * the platform specific read functions of the user
 *
 * @param[in] reg_addr       : Register address from which data is read.
 * @param[out] read_data     : Pointer to data buffer where read data is stored.
 * @param[in] len            : Number of bytes of data to be read.
 * @param[in, out] intf_ptr  : Void pointer that can enable the linking of descriptors
 *                             for interface related call backs.
 *
 *  @retval = BMA4_INTF_RET_SUCCESS -> Success
 *  @retval != BMA4_INTF_RET_SUCCESS  -> Failure Info
 *
 */
typedef BMA4_INTF_RET_TYPE (*bma4_read_fptr_t)(uint8_t reg_addr, uint8_t *read_data, uint32_t len, void *intf_ptr);

/*!
 * @brief Bus communication function pointer which should be mapped to
 * the platform specific write functions of the user
 *
 * @param[in] reg_addr      : Register address to which the data is written.
 * @param[in] read_data     : Pointer to data buffer in which data to be written
 *                            is stored.
 * @param[in] len           : Number of bytes of data to be written.
 * @param[in, out] intf_ptr : Void pointer that can enable the linking of descriptors
 *                            for interface related call backs
 *
 *  @retval = BMA4_INTF_RET_SUCCESS -> Success
 *  @retval != BMA4_INTF_RET_SUCCESS  -> Failure Info
 *
 */
typedef BMA4_INTF_RET_TYPE (*bma4_write_fptr_t)(uint8_t reg_addr, const uint8_t *read_data, uint32_t len,
                                                void *intf_ptr);

/*!
 * @brief Delay function pointer which should be mapped to
 * delay function of the user
 *
 * @param[in] period              : Delay in microseconds.
 * @param[in, out] intf_ptr       : Void pointer that can enable the linking of descriptors
 *                                  for interface related call backs
 *
 */
typedef void (*bma4_delay_us_fptr_t)(uint32_t period, void *intf_ptr);

/******************************************************************************/
/*!  @name         Enum Declarations                                  */
/******************************************************************************/
/*!  @name Enum to define BMA4 variants */
enum  bma4_variant {
    BMA42X_VARIANT = 1,
    BMA42X_B_VARIANT,
    BMA45X_VARIANT
};

/* Enumerator describing interfaces */
enum bma4_intf {
    BMA4_SPI_INTF,
    BMA4_I2C_INTF
};

/**\name    STRUCTURE DEFINITIONS*/

/*!
 *  @brief
 *  This structure holds asic info. for feature configuration.
 */
struct bma4_asic_data
{
    /* Feature config start addr (0-3 bits)*/
    uint8_t asic_lsb;

    /* Feature config start addr (4-11 bits)*/
    uint8_t asic_msb;
};

/*!
 * @brief Auxiliary configuration structure for user settings
 */
struct bma4_aux_config
{
    /*! Device address of auxiliary sensor */
    uint8_t aux_dev_addr;

