timbitss/esp32-smartwatch-sw/components/BMA423/bma4_defs.h
    /*! To enable manual or auto mode */
    uint8_t manual_enable;

    /*! No of bytes to be read at a time */
    uint8_t burst_read_length;

    /*! Variable to set the auxiliary interface */
    uint8_t if_mode;
};

/*!
 *  @brief
 *  This structure holds all relevant information about BMA4
 */
struct bma4_dev
{
    /*! Chip id of BMA4 */
    uint8_t chip_id;

    /*! Chip id of auxiliary sensor */
    uint8_t aux_chip_id;

    /*! Interface pointer */
    void *intf_ptr;

    /*! Interface detail */
    enum bma4_intf intf;

    /*! Variable that holds error code */
    BMA4_INTF_RET_TYPE intf_rslt;

    /*! Auxiliary sensor information */
    uint8_t aux_sensor;

    /*! Decide SPI or I2C read mechanism */
    uint8_t dummy_byte;

    /*! Resolution for FOC */
    uint8_t resolution;

    /*! Define the BMA4 variant BMA42X or BMA45X */
    enum bma4_variant variant;

    /*! Used to check mag manual/auto mode status
     * int8_t mag_manual_enable;
     */

    /*! Config stream data buffer address will be assigned*/
    const uint8_t *config_file_ptr;

    /*! Read/write length */
    uint16_t read_write_len;

    /*! Feature len */
    uint8_t feature_len;

    /*! Contains asic information */
    struct bma4_asic_data asic_data;

    /*! Contains aux configuration settings */
    struct bma4_aux_config aux_config;

    /*! Bus read function pointer */
    bma4_read_fptr_t bus_read;

    /*! Bus write function pointer */
    bma4_write_fptr_t bus_write;

    /*! Delay(in microsecond) function pointer */
    bma4_delay_us_fptr_t delay_us;

    /*! Variable to store the size of config file */
    uint16_t config_size;

    /*! Variable to store the status of performance mode */
    uint8_t perf_mode_status;
};

/*!
 *  @brief This structure holds the information for usage of
 *  FIFO by the user.
 */
struct bma4_fifo_frame
{
    /*! Data buffer of user defined length is to be mapped here */
    uint8_t *data;

    /*! Number of bytes of FIFO to be read as specified by the user */
    uint16_t length;

    /*! Enabling of the FIFO header to stream in header mode */
    uint8_t fifo_header_enable;

    /*! Streaming of the Accelerometer, Auxiliary
     * sensor data or both in FIFO
     */
    uint8_t fifo_data_enable;

    /*! Will be equal to length when no more frames are there to parse */
    uint16_t accel_byte_start_idx;

    /*! Will be equal to length when no more frames are there to parse */
    uint16_t mag_byte_start_idx;

    /*! Will be equal to length when no more frames are there to parse */
    uint16_t sc_frame_byte_start_idx;

    /*! Value of FIFO sensor time time */
    uint32_t sensor_time;

    /*! Value of Skipped frame counts */
    uint8_t skipped_frame_count;

    /*! Value of accel dropped frame count */
    uint8_t accel_dropped_frame_count;

    /*! Value of mag dropped frame count */
    uint8_t mag_dropped_frame_count;
};

/*!
 *  @brief Error Status structure
 */
struct bma4_err_reg
{
    /*! Indicates fatal error */
    uint8_t fatal_err;

    /*! Indicates command error */
    uint8_t cmd_err;

    /*! Indicates error code */
    uint8_t err_code;

    /*! Indicates fifo error */
    uint8_t fifo_err;

    /*! Indicates mag error */
    uint8_t aux_err;
};

/*!
 * @brief Asic Status structure
 */
struct bma4_asic_status
{
    /*! Asic is in sleep/halt state */
    uint8_t sleep;

    /*! Dedicated interrupt is set again before previous interrupt
     * was acknowledged
     */
    uint8_t irq_ovrn;

    /*! Watchcell event detected (asic stopped) */
    uint8_t wc_event;

    /*! Stream transfer has started and transactions are ongoing */
    uint8_t stream_transfer_active;
};

/*!
 * @brief Interrupt Pin Configuration structure
 */
struct  bma4_int_pin_config
{
    /*! Trigger condition of interrupt pin */
    uint8_t edge_ctrl;

    /*! Level of interrupt pin */
    uint8_t lvl;

    /*! Behaviour of interrupt pin to open drain */
    uint8_t od;

    /*! Output enable for interrupt pin */
    uint8_t output_en;

    /*! Input enable for interrupt pin */
    uint8_t input_en;
};

/*!
 * @brief Accelerometer configuration structure
 */
struct bma4_accel_config
{
    /*! Output data rate in Hz */
    uint8_t odr;

    /*! Bandwidth parameter, determines filter configuration */
    uint8_t bandwidth;

    /*! Filter performance mode */
    uint8_t perf_mode;

    /*! G-range */
    uint8_t range;
};

/*!
 * @brief Auxiliary magnetometer configuration structure
 */
struct bma4_aux_mag_config
{
    /*! Poll rate for the sensor attached to the Magnetometer interface */
    uint8_t odr;

    /*! Trigger-readout offset in units of 2.5 ms.
     * If set to zero, the offset is maximum, i.e. after readout a trigger
     * is issued immediately
     */
    uint8_t offset;
};

/*!
 * @brief ASIC Config structure
 */
struct bma4_asic_config
{
    /*! Enable/Disable ASIC Wake Up */
    uint8_t asic_en;

    /*! Configure stream_transfer/FIFO mode */
    uint8_t fifo_mode_en;

    /*! Mapping of instance RAM1 */
    uint8_t mem_conf_ram1;

    /*! Mapping of instance RAM2 */
    uint8_t mem_conf_ram2;

    /*! Mapping of instance RAM3 */
    uint8_t mem_conf_ram3;
};

/*!
 * @brief bmm150 or akm09916
 *  magnetometer values structure
 */
struct bma4_mag
{
    /*! BMM150 and AKM09916 X raw data */
    int32_t x;

    /*! BMM150 and AKM09916 Y raw data */
    int32_t y;

    /*! BMM150 and AKM09916 Z raw data */
    int32_t z;
};

/*!
 * @brief bmm150 xyz data structure
 */
struct bma4_mag_xyzr
{
    /*! BMM150 X raw data */
    int16_t x;

    /*! BMM150 Y raw data */
    int16_t y;

    /*! BMM150 Z raw data */
    int16_t z;

    /*! BMM150 R raw data */
    uint16_t r;
};

/*!
 * @brief Accel xyz data structure
 */
struct bma4_accel
{
    /*! Accel X data */
    int16_t x;

