timbitss/esp32-smartwatch-sw/components/BMA423/bma4_defs.h
    /*! Accel Y data */
    int16_t y;

    /*! Accel Z data */
    int16_t z;
};

/*!
 * @brief FIFO mag data structure
 */
struct bma4_mag_fifo_data
{
    /*! The value of mag x LSB data */
    uint8_t mag_x_lsb;

    /*! The value of mag x MSB data */
    uint8_t mag_x_msb;

    /*! The value of mag y LSB data */
    uint8_t mag_y_lsb;

    /*! The value of mag y MSB data */
    uint8_t mag_y_msb;

    /*! The value of mag z LSB data */
    uint8_t mag_z_lsb;

    /*! The value of mag z MSB data */
    uint8_t mag_z_msb;

    /*! The value of mag r for BMM150 Y2 for YAMAHA LSB data */
    uint8_t mag_r_y2_lsb;

    /*! The value of mag r for BMM150 Y2 for YAMAHA MSB data */
    uint8_t mag_r_y2_msb;
};

/*!
 * @brief Accel self test difference data structure
 */
struct bma4_selftest_delta_limit
{
    /*! Accel X  data */
    int32_t x;

    /*! Accel Y  data */
    int32_t y;

    /*! Accel Z  data */
    int32_t z;
};

/*!  @name Structure to enable an accel axis for FOC */
struct bma4_accel_foc_g_value
{
    /* '0' to disable x-axis and '1' to enable x-axis */
    uint8_t x;

    /* '0' to disable y-axis and '1' to enable y-axis */
    uint8_t y;

    /* '0' to disable z-axis and '1' to enable z-axis */
    uint8_t z;

    /* '0' for positive input and '1' for negative input */
    uint8_t sign;
};

/*! @name Structure to store temporary accelerometer values */
struct bma4_foc_temp_value
{
    /*! X data */
    int32_t x;

    /*! Y data */
    int32_t y;

    /*! Z data */
    int32_t z;
};

/* Structure to store temporary axes data values */
struct bma4_temp_axes_val
{
    /* X data */
    int32_t x;

    /* Y data */
    int32_t y;

    /* Z data */
    int32_t z;
};

#ifdef __cplusplus
}
#endif /*End of CPP guard */